[
    {
      "title": "Software Engineering Systems Graduate",
      "company": "Northeastern University",
      "date": "September 2023 - August 2025",
      "degree": "MS in Software Engineering Systems",
      "description": "Pursuing a Master's degree with a focus on software engineering, system design, and advanced algorithms. Maintaining a GPA of 4.0."
    },
    {
      "title": "Full-Stack Engineer Co-op",
      "company": "Sycamore Informatics, Waltham, MA",
      "date": "July 2024 - December 2024",
      "description": "Spearheaded a full-stack AI-powered semantic search system using Django, React, and Docker on EC2, leveraging MeiliSearch’s vector search with HuggingFace embeddings. Automated daily vector updates and zero-downtime deployment, reducing clinical study creation time by 80%. Resolved 15+ critical bugs in a Rails legacy codebase, improving audit logging and permission logic using Semaphore CI for 100% test coverage."
    },
    {
      "title": "Research Intern",
      "company": "King Faisal University, Remote",
      "date": "April 2022 - October 2022",
      "description": "Developed drone-based crack detection algorithms with 99.28% accuracy and 20% fewer false positives. Co-authored a paper on shallow CNNs for drone-assisted structural assessments, presented at SMARTCOM 2023."
    },
    {
      "title": "Software/Data Engineer Intern",
      "company": "Discite Analytics and AI (a DynPro Company), Bangalore, India",
      "date": "October 2021 - October 2022",
      "description": "Engineered and optimized dashboards and chatbots for 4+ clients. Developed an automated data acquisition system, attracting 3 major clients with $1M+ revenue each. Launched an AWS Lex chatbot for IoT device control and an NLP-driven resume parser, increasing candidate identification efficiency by 50%."
    },
    {
      "title": "Application Developer",
      "company": "Freelancer, Gujarat, India",
      "date": "January 2022 - March 2022",
      "description": "Developed and implemented a Human Resource Management App using Flutter and Firebase, revolutionizing SME operations by eliminating paper-based processes and saving 20 human hours monthly for a local gas station chain."
    },
    {
      "title": "Computer Science Engineering Undergraduate",
      "company": "SRM University",
      "date": "June 2019 - May 2023",
      "degree": "B.Tech in Computer Science and Engineering, specialization in Cloud Computing",
      "description": "Completed undergraduate studies with a focus on cloud computing and security, achieving a GPA of 9.3/10."
    }
  ]
  